import time




class Kalc:
    def start(self):


        print("это калькулятор ")
        print("________________________________________________________________")
        time.sleep(1)
        print("если вам нужно выполнить сумму: /1")
        print("________________________________________________________________")
        time.sleep(1)
        print("если вам нужна разность: /2 ")
        print("________________________________________________________________")
        time.sleep(1)
        print("если вам нужно выполнить умножение: /3")
        print("________________________________________________________________")
        time.sleep(1)
        print("если вам нужно выполнить деление: /4")
        print("________________________________________________________________")
        time.sleep(1)

        deist =  input(" ваш выбор:  ")

        if deist == "/1" :
            perv = int(input("первое число:  "))
            print("________________________________________________________________")
            time.sleep(1)
            vtor = int(input("второе число:  "))
            print(perv+vtor)

        if deist =="/2":
            pervv = int(input("первое число:  "))
            print("________________________________________________________________")
            time.sleep(1)
            vtorr = int(input("второе число:  "))
            print(pervv-vtorr)

        if deist =="/3":
            pervvv = int(input("первое число:  "))
            print("________________________________________________________________")
            time.sleep(1)
            vtorrr = int(input("второе число:  "))
            print(pervvv*vtorrr)




        if deist =="/4":
            pervvvv = int(input("первое число:  "))
            print("________________________________________________________________")
            time.sleep(1)
            vtorrrrr = int(input("второе число:  "))
            print(pervvvv/vtorrrrr)








